[LANG]
language=Spanish (España)
[FONT]
font-name=Segoe UI
welcome-text-size=62
home-text-size=22
home-section-size=24
analysis-text-size=20
analysis-section-size=22
left-panel-size=14
panel-list-size=16
panel-list-label-size=20
panel-list-header-size=16
panel-list-item-size=13
panel-button-size=12
combobox-size=16
list-combobox-size=16
checkbox-size=16
radio-size=15
elem-size=12
image-button-size=14
form-text-size=15
list-text-size=16
search-edit-size=16
message-text-size=16
setting-button-size=12
process-text-size=14
properites-title-font=18
properites-section-font=16
log-list-item-text-size=12
log-list-item-sql-size=14
[ERROR]
000000=
200001=Error de sintaxis SQL
200002=El archivo no existe
200003=El archivo está dañado
200004=Error de parámetro
200026=El nombre de la tabla ya existe
200027=El nombre de la tabla no existe
200028=Error al importar el archivo CSV, no se pudo generar SQL, verifique el contenido del archivo CSV y la configuración
300001=No se seleccionaron columnas de la tabla para crear el índice
300002=La declaración SQL no puede estar vacía
300003=El análisis SQL solo admite consultas SELECT
[STRING]
home=Inicio
database=Base de datos
analysis=Análisis
view=Vista
setting=Configuración
items=registros
tables=Tablas
views=Vistas
triggers=Disparadores
columns=Columnas
indexes=Índices
table=Tabla
clear-all=Limpiar todo
yes=Sí
no=No
welcome-text=Bienvenido a CuteSqlite
home-text1=CuteSqlite es una herramienta de cliente gráfico (GUI) para Sqlite3.
home-text2=Le permite diseñar, crear y explorar bases de datos, gestionar objetos de base de datos,
home-text3=e insertar datos, así como diseñar y ejecutar consultas SQL para procesar los datos almacenados.
home-text4=También puede migrar la base de datos y los datos de otros proveedores de bases de datos a una base de datos Sqlite.
db-section-text=Base de datos Sqlite
analysis-text1=CuteSqlite le permite analizar y optimizar el rendimiento de las declaraciones SQL.
analysis-text2=Y también le permite analizar la capacidad de almacenamiento de cada tabla en la base de datos,
analysis-text3=así como configurar los parámetros de la base de datos para optimizarla.
perf-analysis-section-text=Análisis de rendimiento
error-text=Error del sistema:
create-database=Crear nueva base de datos (Ctrl+N)
open-database=Abrir una base de datos (Ctrl+O)
refresh-database=Actualizar base de datos (F5)
delete-database=Eliminar la base de datos seleccionada de la lista (Supr)
override-user-db=Los datos del archivo eliminado no se pueden recuperar. ¿Confirmar sobrescribir la base de datos?
create-db-success-text=Base de datos creada con éxito
open-db-exists-inlist=La base de datos ya está abierta, no repita la operación
open-db-success-text=Base de datos abierta con éxito
delete-user-db=¿Confirmar eliminar la base de datos "{dbName}" de la lista?
delete-db-success-text=Base de datos eliminada de la lista con éxito
query-editor=Editor de consultas
history=Historial
history-tip=Historial (F8)
result-list=Resultados
result-info=Información
result-table-data=Datos de la tabla
table-properties=Propiedades de la tabla
exec-select-sql=Ejecutar la consulta seleccionada (F9)
exec-all-sql=Ejecutar todas las consultas (F10)
explain-select-sql=Explain la declaración SQL seleccionada (F11)
explain-query-plan-sql=Explain query plan de la declaración SQL seleccionada (F12)
query-page-help=Función de autocompletado: [Tab] -> siguiente pestaña; [Ctrl+Espacio] -> listar coincidencias; [Ctrl+Intro] -> listar todas las etiquetas
no-select-userdb=No se seleccionó ninguna base de datos
no-sql-statement=El editor de consultas no tiene ninguna declaración SQL
no-sql-content=El editor de consultas no tiene contenido SQL
show-form-view=Mostrar vista de formulario
export-result-as=Exportar como... (Ctrl+Alt+E)
copy-result-data=Copiar datos al portapapeles
clear-all=Limpiar todo
ok=Aceptar
cancel=Cancelar
export-text-description=Seleccione el formato para exportar los datos
csv-settings=Opciones CSV
csv-field-settings=Columnas
csv-line-settings=Filas
csv-charset-settings=Juego de caracteres
excel-settings=Opciones de Excel
sql-settings=Opciones SQL
export-fields-settings=Seleccione las columnas a exportar
terminated-by=Separador
enclosed-by=Encerrado por
escaped-by=Carácter de escape
field-terminated-by=Separador de columnas
field-enclosed-by=Encerrado de columnas
field-escaped-by=Carácter de escape de columnas
line-terminated-by=Separador de líneas
add-column-name=Agregar nombre de columna en el encabezado
csv-charset=Juego de caracteres
excel-column-max-size=Límite de tamaño de columna de texto
excel-decinmal-places=Posiciones decimales
structure-only=Solo estructura
data-only=Solo datos
structure-and-data=Estructura y datos
select-all=Seleccionar todo
deselect-all=Deseleccionar todo
save-to-file=Guardar en archivo
expert-fmt-error=Por favor, seleccione el formato de archivo para exportar los datos
terminated-by-error=Por favor, introduzca el valor para "Separador"
enclosed-by-error=Por favor, introduzca el valor para "Encerrado por"
escaped-by-error=Por favor, introduzca el valor para "Carácter de escape"
line-terminated-by-error=El valor del "Separador de líneas" es incorrecto
excel-column-max-size-error=Por favor, introduzca el valor para "Límite de tamaño de columna de texto"
excel-decinmal-places-error=Por favor, introduzca el valor para "Posiciones decimales"
export-sql-error=Por favor, seleccione las opciones SQL
selected-fields-error=Por favor, seleccione las columnas a exportar
export-path-error=Por favor, introduzca la ruta del archivo de exportación
sql-notsupport-multitable-query-error=No se admite la exportación de resultados de consultas multitabla y subconsultas
export-success-text=Exportación exitosa, se exportaron {rows} filas de datos. ¿Abrir archivo?
open-the-file=Abrir archivo
export-file-exists-prompt={export-path} ya existe. ¿Reemplazar?
limit-rows=Límite de filas
offset=Fila de inicio
rows=Número de filas
copy-all-rows-to-clipboard=Copiar todas las filas al portapapeles Ctrl+Alt+A
copy-sel-rows-to-clipboard=Copiar filas seleccionadas al portapapeles Ctrl+Alt+H
copy-all-rows-as-sql=Copiar todas las filas como SQL Ctrl+Alt+J
copy-sel-rows-as-sql=Copiar filas seleccionadas como SQL Ctrl+Alt+K
read-only=Solo lectura
filter=Filtro (Ctrl+Alt+F)
filter-in-use=Filtro en uso
refresh=Actualizar (Ctrl+F5)
refresh-page=Actualizar
new-row-tip=Nueva fila (Ctrl+Alt+N)
copy-row-tip=Copiar fila (Ctrl+Alt+C)
save-tip=Guardar (Ctrl+Alt+S)
delete-tip=Eliminar fila seleccionada (Ctrl+Supr)
cancel-tip=Deshacer cambios (Ctrl+Alt+Z)
revert-tip=Restaurar
save=Guardar
revert=Deshacer cambios
column=Nombre de columna
condition=Condición
value=Valor
delete-confirm-text=¿Confirmar eliminación de las filas seleccionadas?
query=Consulta
result=Resultado
affected-rows=Filas afectadas
exec-time=Tiempo de ejecución
transfer-time=Tiempo de transferencia
total-time=Tiempo total
database-create=Crear BD Ctrl+N
database-open=Abrir BD Ctrl+O
database-refresh=Actualizar BD Ctrl+R
database-delete=Eliminar BD Supr
database-copy=Copiar BD como... Ctrl+P
database-export-as-sql=Exportar BD a SQL Ctrl+E
database-import-from-sql=Importar SQL a BD Ctrl+I
database-new=Crear
database-new-table=Tabla
database-new-view=Vista
database-new-trigger=Disparador
export-as-sql-text-description=Exportar tablas/vistas/disparadores de la BD seleccionada como SQL
select-database=Base de datos seleccionada
database-objects=Objetos
structure-and-data-settings=Configuración de estructura y datos
insert-statement-settings=Configuración de la declaración INSERT
tbl-statement-settings=Configuración de declaraciones de tabla
retain-column-text=Conservar nombres de columna en "Insert Into"
contain-multi-rows-text=Cada declaración "Insert" contiene varias filas (VALUES)
retain-table-text=Conservar tabla antigua (Create Table If Not Exists ...)
override-table-text=Sobrescribir tabla antigua (DROP TABLE, luego CREATE TABLE)
import-from-sql-text-description=Ejecución por lotes de las declaraciones en el archivo SQL.
abort-on-error-text=Detener en caso de error.
import-file-not-exists=El archivo SQL a importar no existe, seleccione otro.
import-path-empty-error=La ruta del archivo de importación no puede estar vacía.
import=Importar
export=Exportar
tbl-name=Nombre de la tabla
new-table=Crear tabla
new-view=Crear vista
new-trigger=Crear disparador
database=Base de datos
schema=Esquema
table-columns=Columnas
table-indexes=Índices
table-foreignkeys=Claves foráneas
column-name=Nombre de la columna
data-type=Tipo de dato
default=Por defecto
check=Comprobación
index-name=Nombre del índice
index-type=Tipo de índice
index-unique=Único
partial-clause=Cláusula parcial
comments=Comentarios
to-be-selected=Columnas disponibles
selected=Seleccionadas
up=▲
down=▼
no-columns-selected=No se seleccionaron columnas, por favor seleccione
sql-preview=Vista previa SQL
tbl-name-empty=El nombre de la tabla no puede estar vacío
tbl-name-duplicated=El nombre de la tabla ya existe
create-table-success-text=Tabla creada con éxito.
alter-table-success-text=Tabla modificada con éxito.
rename-table-success-text=Nombre de tabla modificado con éxito.
delete-column-confirm-text=La columna seleccionada está referenciada por uno o más índices. Eliminar esta columna también modificará los índices correspondientes. ¿Confirmar eliminación?
delete-index-confirm-text=El índice seleccionado está referenciado por una o más columnas. Eliminar este índice también modificará las columnas correspondientes. ¿Confirmar eliminación?
delete-confirm-text=¿Confirmar eliminación?
new-view=Crear vista
new-trigger=Crear disparador
create-a-view-name=Nombre de la nueva vista
view-name-not-empty=El nombre de la nueva vista no puede estar vacío
view-name-duplicated=El nombre de la vista ya existe
create-a-trigger-name=Nombre del disparador
trigger-name-not-empty=El nombre del disparador no puede estar vacío
trigger-name-duplicated=El nombre del disparador ya existe
execute-sql-success=SQL ejecutado con éxito
copy-db-success-text=Base de datos copiada con éxito
table-open=Abrir datos de la tabla Alt+O
table-create=Crear tabla Alt+N
table-alter=Modificar tabla Alt+A
table-rename=Renombrar tabla Alt+M
table-truncate=Vaciar tabla Alt+T
table-drop=Eliminar tabla Alt+Supr
table-copy-as=Copiar tabla a... Alt+P
table-sharding-as=Fragmentación Alt+G
table-export=Exportar tabla a... Alt+E
table-import-sql=Importar desde archivo SQL Alt+I
table-import-csv=Importar desde archivo CSV Alt+J
table-manage-index=Gestionar índices de la tabla
table-manage-foreign-key=Gestionar claves foráneas de la tabla
properties=Propiedades
primary-key-duplicated=La clave primaria está definida múltiples veces.
foreignkey-name=Nombre de la clave foránea
referencing-columns=Columnas de esta tabla
referenced-table=Tabla referenciada
referenced-columns=Columnas referenciadas
on-update=Al actualizar
on-delete=Al eliminar
insert-new-column=Agregar nueva columna
insert-new-index=Agregar nuevo índice
insert-new-foreignkey=Agregar nueva clave foránea
insert-del-column=Eliminar columna seleccionada
insert-del-index=Eliminar índice seleccionado
insert-del-foreignkey=Eliminar clave foránea seleccionada
select-referenced-table-first=Por favor, seleccione primero la tabla referenciada
new-table-name=Nuevo nombre de tabla
table-name-not-empty=El nuevo nombre de tabla no puede estar vacío
table-name-duplicated=El nuevo nombre de tabla ya existe
ai-column-exists=Ya existe una columna AUTOINCREMENT.
ai-fobidden-multi-pk=Ya existe una columna AUTOINCREMENT, no se permiten múltiples columnas de clave primaria.
ai-column-must-integer=La columna AUTOINCREMENT debe ser de tipo INTEGER.
truncate-table-confirm-text=Después de vaciar la tabla, los datos no se pueden recuperar. ¿Confirmar vaciado?
truncate-table-success-text=Datos de la tabla vaciados con éxito
drop-table-confirm-text=Después de eliminar la tabla, los datos no se pueden recuperar. ¿Confirmar eliminación?
drop-table-success-text=Tabla eliminada con éxito
copy-table-text-description=Configuración de parámetros de copia, admite fragmentación de tablas
from-db-name=Base de datos origen
from-tbl-name=Tabla origen
to-db-name=Base de datos destino
to-tbl-name=Tabla destino
table-sharding-setttings=Fragmentación de tabla
enable-table-sharding=Activar fragmentación de tabla
table-suffix-begin={suffix} Entero inicial
table-suffix-end={suffix} Entero final
advanced-settings=Opciones avanzadas de fragmentación
enable-copy-data-with-strategy=Activar estrategia para copiar datos a tablas fragmentadas
sharding-strategy-express-text=Expresión de estrategia de fragmentación: {n}
preview-sql=Vista previa de la declaración SQL
structure-and-data-settings-unknown=Configuración de estructura y datos no seleccionada
table-suffix-error=Entero de fragmentación inválido, introduzca un valor correcto
target-table-name-no-n=La tabla destino debe contener la cadena "{n}".
sharding-strategy-express-empty=La expresión de estrategia de fragmentación no puede estar vacía
copy-table-success-text=Tabla copiada con éxito.
start=Iniciar
complete=Completado
express-title=Expresión de estrategia de fragmentación de tabla
functions=Funciones
express-editor-help=Expresión - haga doble clic en una función o campo para insertarlo en el editor
import-from-csv-text-description=Configuración para importar datos desde un archivo CSV
source-csv-file=Ruta del archivo CSV origen
target-database=Base de datos destino
target-table=Tabla destino
columns-setttings=Columnas
csv-data=Datos CSV
column-name-on-top=Primera fila como nombres de columna
line-terminated-by=Separador de líneas
csv-null-as-keyword=null/NULL como palabra clave SQL
encoding=Codificación
import-success-text=Importación exitosa
incorrect-sql-statement=Declaración SQL incorrecta
import-error-text=Error de importación
table-manage-columns=Gestionar columnas
table-drop-column=Eliminar columna
table-manage-indexes=Gestionar índices
table-drop-index=Eliminar índice
create-view=Crear nueva vista
open-view=Abrir vista
drop-view=Eliminar vista
create-trigger=Crear disparador
open-trigger=Abrir disparador
drop-trigger=Eliminar disparador
drop-view-confirm-text=Después de eliminar la vista, no se puede recuperar. ¿Confirmar eliminación?
drop-view-success-text=Vista eliminada con éxito
drop-trigger-confirm-text=Después de eliminar el disparador, no se puede recuperar. ¿Confirmar eliminación?
drop-trigger-success-text=Disparador eliminado con éxito
sql-templates=Plantillas de declaraciones SQL
pragma-templates=Pragmas
sql-log=Historial SQL
clear-all=Limpiar todo
use=Usar
explain=Explain
top=Fijar
untop=Desfijar
copy=Copiar
delete=Eliminar
today=Hoy
yestoday=Ayer
delete-sql-log-confirm-text=¿Está seguro de que desea eliminar el historial SQL?
copy-to-clipboard=Copiado al portapapeles
save-success-text=Guardado con éxito
delete-success-text=Eliminado con éxito
data-has-changed=Los datos han cambiado. ¿Está seguro de que desea cerrar la página?
not-save-and-close=No guardar, cerrar
cancel=Cancelar cierre
table-export-as=Exportar tabla Alt+E
export-as-sql-success-text=Exportación exitosa. ¿Abrir archivo?
new-query=Nueva ventana de consulta (F7)
save-current=Guardar actual (Ctrl+S)
save-all=Guardar todo (Ctrl+Mayús+S)
first-page=Primera página
prev-page=Página anterior
next-page=Página siguiente
last-page=Última página
save-if-data-has-changed=Los datos han cambiado. ¿Guardar antes de cerrar?
unsort=Deshacer ordenación
tab-close-this=Cerrar esta
tab-close-others=Cerrar las otras
tab-close-left=Cerrar todas a la izquierda
tab-close-right=Cerrar todas a la derecha
perf-analysis=Análisis de rendimiento
perf-analysis-reports=Informes de análisis
store-analysis=Análisis de almacenamiento
db-params=Parámetros de BD
not-select-sql=Solo se admiten declaraciones SELECT
open-sql-log=Abrir historial SQL para análisis de rendimiento (Ctrl+L)
add-sql-analysis=Introduzca una declaración SQL para análisis de rendimiento (Ctrl+I)
sql-log-not-found=No se encontró el historial SQL, verifique si ha sido eliminado
original-sql=Declaración SQL original
where-clause-analysis=Análisis de la cláusula WHERE
order-clause-analysis=Análisis de la cláusula ORDER
covering-index-analysis=Análisis de índices cobertura
table-join-analysis=Análisis de JOIN
in-table=Tabla de datos
where-use-column=La cláusula WHERE usa columnas
order-use-column=La cláusula ORDER usa columnas
covering-index-column=Las cláusulas WHERE y ORDER usan columnas
where-use-index=La cláusula WHERE usa un índice
order-use-index=La cláusula ORDER usa un índice
use-covering-index=Usa un índice de cobertura
create-index-for-performance=Recomendación: cree un índice para las siguientes columnas para mejorar el rendimiento de las consultas
hint-index-for-performance=Sugerencia: el índice {hintIndexName} ya cubre las columnas: {hintIndexColumns}
create-covering-index-for-performance=Recomendación: cree un índice de cobertura para las siguientes columnas para mejorar el rendimiento de las consultas
create-index-togeger=Crear índice (juntos)
create-index-individ=Crear índices (por separado)
create-covering-index=Crear índice de cobertura
explain-query-plan=Explain Query Plan
query-optimizer-pseudocode=El pseudocódigo siguiente muestra el proceso de ejecución del optimizador de consultas
cycle-count=Estadísticas de ciclos
optimize-cycle-count=Sugerencia: cambiar el orden de unión de las tablas JOIN puede optimizar y reducir el número de ciclos.
general-settings=Configuración general
about=Acerca de
language-setting=Configuración de idioma de la interfaz
change-language-restart-text=Para cambiar el idioma, debe reiniciar el software.
close-and-restart=Cerrar y reiniciar
do-not-restart=No reiniciar
about-us=Sobre nosotros
about-us-description=CuteSqlite es un software de código abierto desarrollado por el autor Xuehan Qin.
version-info=Versión
version-info-description=CuteSqlite v0.2.2 beta (64 bits)
feedback=Comentarios
feedback-description=Si tiene problemas con el software, o tiene ideas y sugerencias para esta aplicación, complete el siguiente formulario para enviarnos sus comentarios.
content-text=Contenido
license=Licencia Apache Versión 2.0
select-columns-analysis=Análisis de columnas SELECT
select-use-column=La declaración SELECT usa las siguientes columnas
select-use-column-count=Número de columnas
select-use-column-advice=Recomendación: la declaración SELECT selecciona más de {maxColumns} columnas. Reducir el número de columnas puede mejorar el rendimiento de las consultas.
select-use-column-tips=Sugerencia: reducir el número de columnas puede mejorar el rendimiento de las consultas.
sql-perf-report-prefix=informe-rendimiento-sql-
store-analysis-prefix=Análisis de almacenamiento:
analysis-sql=Análisis SQL
open-perf-report=Abrir informe Alt+O
drop-perf-report=Eliminar informe Alt+Supr
drop-perf-report-confirm-text=¿Confirmar eliminación del informe?
store-analysis-text=Le permite analizar la capacidad de almacenamiento de la base de datos, las tablas y los índices
table-store-analysis=Tabla - {tblName}
index-store-analysis=Índice - {idxName} - Tabla: {tblName}
db-disk-used-title=Informe de uso de espacio en disco, ruta de BD: {dbPath}
page-size-text=Tamaño de página (bytes)
page-size-tips=Tamaño de página (bytes)
file-bytes-text=Tamaño de archivo (bytes)
file-bytes-tips=Tamaño de archivo (bytes)
file-pgcnt-text=Número de páginas en todo el archivo (medido)
file-pgcnt-tips=Número de páginas en todo el archivo (medido)
file-pgcnt2-text=Número de páginas en todo el archivo (calculado)
file-pgcnt2-tips=Número de páginas en todo el archivo (calculado)
inuse-pgcnt-text=Número de páginas que almacenan datos (usadas)
inuse-pgcnt-tips=Número de páginas que almacenan datos (usadas)
free-pgcnt2-text=Número de páginas sin datos (por cabecera)
free-pgcnt2-tips=Número de páginas sin datos (por cabecera)
free-pgcnt-text=Número de páginas sin datos (calculado)
free-pgcnt-tips=Número de páginas sin datos (calculado)
av-pgcnt-text=Número de páginas limpiadas automáticamente
av-pgcnt-tips=Número de páginas limpiadas automáticamente
ntable-text=Número de tablas en la BD
ntable-tips=Número de tablas en la BD
nindex-text=Número de índices
nindex-tips=Número de índices
nmanindex-text=Número de índices definidos
nmanindex-tips=Número de índices definidos
nautoindex-text=Número de índices implícitos (auto-incremento)
nautoindex-tips=Número de índices implícitos (auto-incremento)
user-payload-text=Bytes de carga útil de usuario almacenados
user-payload-tips=Bytes de carga útil de usuario almacenados
all-tbl-entrycnt-title=Total de datos en todas las tablas (número de registros)
all-tbl-idx-pagecnt-title=Número de páginas de todas las tablas y sus índices
sperate-tbl-idx-pagecnt-title=Páginas de todas las tablas e índices calculadas por separado
all-tbl-idx-report-title=Todas las tablas e índices
total-pages-percent-text=Porcentaje del total de páginas de la BD
total-pages-percent-tips=Porcentaje del total de páginas de la BD
nentry-text=Cantidad de datos (número de registros)
nentry-tips=Cantidad de datos (número de registros)
storage-text=Bytes de almacenamiento utilizados
storage-tips=Bytes de almacenamiento utilizados
compressed-size-text=Bytes utilizados después de la compresión
compressed-size-tips=Bytes utilizados después de la compresión
payload-text=Bytes de carga útil
payload-tips=Bytes de carga útil
total-meta-text=Bytes de metadatos
total-meta-tips=Bytes de metadatos
depth-text=Profundidad del árbol B
depth-tips=Profundidad del árbol B
avg-payload-text=Carga útil promedio por registro
avg-payload-tips=Carga útil promedio por registro
avg-unused-text=Promedio de bytes no utilizados por registro
avg-unused-tips=Promedio de bytes no utilizados por registro
avg-meta-text=Metadatos promedio por registro
avg-meta-tips=Metadatos promedio por registro
avg-fanout-text=Factor de ramificación promedio
avg-fanout-tips=Factor de ramificación promedio
gap-cnt-text=Páginas no contiguas
gap-cnt-tips=Páginas no contiguas
mx-payload-text=Carga útil máxima por registro
mx-payload-tips=Carga útil máxima por registro
ovfl-cnt-text=Número de registros de desbordamiento utilizados
ovfl-cnt-tips=Número de registros de desbordamiento utilizados
int-pages-text=Número de páginas de índice utilizadas
int-pages-tips=Número de páginas de índice utilizadas
leaf-pages-text=Número de páginas hoja utilizadas
leaf-pages-tips=Número de páginas hoja utilizadas
ovfl-pages-text=Número de páginas de desbordamiento utilizadas
ovfl-pages-tips=Número de páginas de desbordamiento utilizadas
total-pages-text=Número total de páginas utilizadas
total-pages-tips=Número total de páginas utilizadas
int-unused-text=Bytes no utilizados en páginas de índice
int-unused-tips=Bytes no utilizados en páginas de índice
leaf-unused-text=Bytes no utilizados en páginas hoja
leaf-unused-tips=Bytes no utilizados en páginas hoja
ovfl-unused-text=Bytes no utilizados en páginas de desbordamiento
ovfl-unused-tips=Bytes no utilizados en páginas de desbordamiento
total-unused-text=Bytes no utilizados en todas las páginas
total-unused-tips=Bytes no utilizados en todas las páginas
all-table-report-title=Todas las tablas (excluyendo índices)
all-indices-report-title=Todos los índices (excluyendo tablas)
tbl-and-all-idx-report-title=Tabla {tblName} y todos sus índices
tbl-only-report-title=Tabla {tblName} (excluyendo cualquier índice)
idx-only-report-title=Todos los índices de la tabla {tblName}
tbl-report-title=Tabla {tblName}
idx-report-title=Índice {idxName} de la tabla {tblName}
props-tbl-only-report-title=Análisis de almacenamiento de la tabla {tblName}
props-idx-props-only-report-title=Todos los índices de la tabla {tblName}
db-pragma-params=Parámetros PRAGMA
db-quick-config-params=Opciones de configuración rápida
select-pragma=PRAGMA
pragma-analysis-limit-tips=Consulta o modifica el límite de la configuración de análisis (ANALYZE). Es el número aproximado de filas que el comando ANALYZE examina en cada índice.
pragma-application-id-tips=Se utiliza para consultar o establecer el entero con signo de 32 bits "Application ID" en big-endian ubicado en el desplazamiento 68 en el encabezado de la base de datos.
pragma-auto-vacuum-tips=Consulta o establece el estado de limpieza automática (auto-vacuum) en la base de datos.
pragma-automatic-index-tips=Consulta, activa o desactiva la función de indexación automática.
pragma-busy-timeout-tips=Consulta o modifica la configuración de tiempo de espera (busy timeout).
pragma-cache-size-tips=Consulta o modifica el número máximo de páginas de disco de la base de datos que SQLite recomienda mantener en memoria para cada archivo de base de datos abierto.
pragma-cache-spill-tips=Activa o desactiva la capacidad del programa de paginación de volcar páginas de caché sucias al archivo de base de datos en medio de una transacción.
pragma-case-sensitive-like-tips=El comportamiento predeterminado del operador LIKE ignora mayúsculas/minúsculas para caracteres ASCII. Por lo tanto, de forma predeterminada, 'a' LIKE 'A' es verdadero.
pragma-cell-size-check-tips=Activa o desactiva comprobaciones de coherencia adicionales al leer páginas del árbol B de la base de datos desde el disco. Cuando la verificación del tamaño de celda está activada, la corrupción de la base de datos se puede detectar antes y es menos probable que se "propague".
pragma-checkpoint-fullfsync-tips=Consulta o modifica el flag fullfsync para operaciones de punto de control (checkpoint). Si este flag está activado, se utilizará el método de sincronización F_FULLFSYNC durante las operaciones de punto de control en sistemas que lo admitan. El valor predeterminado del flag CHECKPOINT_FULLFSYNC es OFF. Solo Mac OS-X admite F_FULLFSYNC.
pragma-collation-list-tips=Devuelve la lista de secuencias de intercalación definidas para la conexión de base de datos actual.
pragma-compile-options-tips=Devuelve los nombres de las opciones de compilación utilizadas al construir SQLite, una opción por línea.
pragma-count-changes-tips=Consulta o modifica el flag de recuento de cambios (count changes). Normalmente, cuando el flag count-changes no está configurado, las declaraciones INSERT, UPDATE y DELETE no devuelven datos.
pragma-data-store-directory-tips=Consulta o modifica el valor de la variable global sqlite3_data_directory, utilizada por el backend de la interfaz del sistema operativo Windows para determinar la ubicación de almacenamiento de los archivos de base de datos especificados con una ruta relativa.
pragma-data-version-tips=Indica que el archivo de base de datos ha sido modificado. Los programas interactivos que almacenan el contenido de la base de datos en memoria o lo muestran en pantalla pueden usar el comando PRAGMA data_version para determinar si necesitan actualizar y recargar la memoria o actualizar la visualización en pantalla.
pragma-default-cache-size-tips=Consulta o establece el número máximo recomendado de páginas de caché de disco que se asignarán para cada archivo de base de datos abierto.
pragma-defer-foreign-keys-tips=Ordena que todas las restricciones de clave foránea se difieran hasta la confirmación de la transacción más externa.
pragma-empty-result-callbacks-tips=Consulta o modifica el flag de devolución de llamada de resultado vacío.
pragma-encoding-tips=Codificación de texto utilizada por la base de datos principal: 'UTF-8', 'UTF-16le' (UTF-16 little-endian) o 'UTF-16be' (UTF-16 big-endian).
pragma-foreign-key-check-tips=Verifica la base de datos o tabla en busca de violaciones de restricciones de clave foránea.
pragma-foreign-keys-tips=Consulta, activa o desactiva la aplicación de restricciones de clave foránea.
pragma-freelist-count-tips=Devuelve el número de páginas no utilizadas en el archivo de base de datos.
pragma-full-column-names-tips=Consulta o modifica el flag full_column_names.
pragma-fullfsync-tips=Consulta o modifica el flag fullfsync. Este flag determina si se utilizará el método de sincronización F_FULLFSYNC en sistemas que lo admitan. El valor predeterminado de fullfsync es OFF. Solo Mac OS X admite F_FULLFSYNC.
pragma-hard-heap-limit-tips=Establece un límite en la cantidad de memoria de montón (heap) para todas las conexiones de base de datos en un solo proceso.
pragma-ignore-check-constraints-tips=Activa o desactiva la aplicación de restricciones CHECK. La configuración predeterminada es OFF, lo que significa que las restricciones CHECK se aplican de forma predeterminada.
pragma-incremental-vacuum-tips=Hace que se eliminen hasta N páginas de la lista de páginas libres (freelist).
pragma-integrity-check-tips=Realiza una verificación de formato y consistencia de bajo nivel en la base de datos.
pragma-journal-mode-tips=Consulta o establece el modo de diario (journal mode) para la base de datos asociada a la conexión actual.
pragma-journal-size-limit-tips=Limita el tamaño de los archivos de diario de reversión (rollback journal) y WAL que se conservan en el sistema de archivos después de una transacción o punto de control.
pragma-legacy-alter-table-tips=Establece o consulta el valor del flag legacy_alter_table.
pragma-locking-mode-tips=Establece o consulta el modo de bloqueo (locking mode) de la conexión a la base de datos. Los modos son NORMAL o EXCLUSIVE.
pragma-max-page-count-tips=Consulta o establece el número máximo de páginas en el archivo de base de datos.
pragma-mmap-size-tips=Consulta o modifica el número máximo de bytes reservados para E/S de memoria mapeada (memory-mapped I/O) en una sola base de datos.
pragma-module-list-tips=Devuelve la lista de módulos de tablas virtuales registrados en la conexión de base de datos.
pragma-optimize-tips=Intenta optimizar la base de datos.
pragma-page-count-tips=Devuelve el número total de páginas en el archivo de base de datos.
pragma-page-size-tips=Consulta o establece el tamaño de página de la base de datos. El tamaño de página debe ser una potencia de dos entre 512 y 65536.
pragma-parser-trace-tips=Activa el rastreo del analizador sintáctico SQL utilizado internamente por SQLite. Solo tiene efecto si se compila con SQLITE_DEBUG.
pragma-query-only-tips=Impide la modificación de datos en el archivo de base de datos. Cuando está activado, cualquier intento de CREATE, UPDATE, DROP, INSERT o UPDATE provocará un error SQLITE_READONLY.
pragma-quick-check-tips=Realiza una verificación de formato y consistencia de bajo nivel en la base de datos, omitiendo las verificaciones de consistencia UNIQUE y de índices.
pragma-read-uncommitted-tips=Consulta, activa o desactiva el nivel de aislamiento READ UNCOMMITTED.
pragma-recursive-triggers-tips=Consulta, activa o desactiva la ejecución recursiva de disparadores.
pragma-reverse-unordered-selects-tips=Cuando está activada, esta pragma hace que muchas consultas SELECT sin cláusula ORDER BY devuelvan los resultados en un orden generalmente inverso.
pragma-schema-version-tips=Obtiene o establece el valor entero schema_version en el desplazamiento 40 en el encabezado de la base de datos.
pragma-secure-delete-tips=Consulta o modifica la configuración de eliminación segura (secure-delete).
pragma-short-column-names-tips=Consulta o modifica el flag de nombres de columna cortos.
pragma-soft-heap-limit-tips=Limita la cantidad de memoria de montón utilizada por todas las conexiones de base de datos en un solo proceso.
pragma-stats-tips=Devuelve información auxiliar sobre tablas e índices.
pragma-synchronous-tips=Consulta o modifica la configuración del flag "synchronous".
pragma-temp-store-tips=Consulta o modifica el valor de la variable global sqlite3_temp_directory, utilizada por muchos backends de interfaz del sistema operativo para determinar la ubicación de almacenamiento de tablas e índices temporales.
pragma-threads-tips=Número de hilos auxiliares iniciados por una declaración preparada (prepared statement) para ayudar en la consulta.
pragma-trusted-schema-tips=Permite o no la ejecución de funciones SQL y tablas virtuales no verificadas en el esquema. Determina si las vistas, los disparadores o las expresiones de esquema (como restricciones CHECK, cláusulas DEFAULT, columnas generadas, índices de expresión y/o índices parciales) pueden ejecutar funciones SQL y tablas virtuales no verificadas.
pragma-user-version-tips=Obtiene o establece el valor entero user_version en el desplazamiento 60 en el encabezado de la base de datos.
pragma-vdbe-addoptrace-tips=Los códigos de operación VDBE completos se muestran durante la generación de código. Funciona si SQLite se compila con la opción SQLITE_DEBUG y vdbe_debug está activado.
pragma-vdbe-debug-tips=Activa la depuración de VDBE. Funciona si SQLite se compila con la opción SQLITE_DEBUG.
pragma-vdbe-listing-tips=Muestra la lista completa de códigos de operación de la máquina virtual en la salida estándar. Funciona si SQLite se compila con la opción SQLITE_DEBUG y vdbe_debug está activado.
pragma-vdbe-trace-tips=Imprime los códigos de operación de la máquina virtual en la salida estándar durante el cálculo. Funciona si SQLite se compila con la opción SQLITE_DEBUG y vdbe_debug está activado.
pragma-wal-autocheckpoint-tips=Consulta o establece el intervalo de punto de control automático (auto-checkpoint) para el registro de escritura anticipada (write-ahead log).
pragma-wal-checkpoint-tips=Hace que el contenido del registro de escritura anticipada (write-ahead log) para la base de datos X en la conexión D se transfiera al archivo de base de datos y se restablezca el registro.
pragma-writable-schema-tips=Permite modificar la tabla sqlite_schema mediante declaraciones UPDATE, INSERT y DELETE ordinarias. Advertencia: el mal uso de esta pragma puede dañar fácilmente el archivo de base de datos.
pragma-save-confirm=La declaración PRAGMA afectará el funcionamiento de la base de datos. ¿Confirmar la ejecución de la siguiente declaración?
confirm-exec-text=Confirmar y ejecutar